app/Models/ModelProdi.php

   public function AllData()
   {
    return $this->db->table('prodi')->get()->getResultArray();
---
SELECT *
FROM `prodi`

   public function UpdateData($data)
   {
    $this->db->table('prodi')
        ->where('kode_prodi', $data['kode_prodi'])
        ->update($data);
---
UPDATE `prodi` SET `kode_prodi` = '232523', `nama_prodi` = 'Akutansi Perpajakan'
WHERE `kode_prodi` = '232523'

   public function DeleteData($data)
   {
    $this->db->table('prodi')
        ->where('kode_prodi', $data['kode_prodi'])
        ->delete($data);
---
DELETE FROM `prodi`
WHERE `kode_prodi` = '2325'
AND `kode_prodi` = '2325'