app/Models/ModelMatkul.php

   public function AllData()
   {
    return $this->db->table('matakuliah')->get()->getResultArray();
---
SELECT *
FROM `matakuliah`

   public function InsertData($data)
   {
        $this->db->table('matakuliah')->insert($data);
---
INSERT INTO `matakuliah` (`kode_matkul`, `nama_matkul`, `sks`) VALUES ('04', 'Bahasa Inggris', '3')