app/Models/ModelMahasiswa.php

SELECT *
FROM `mahasiswa`
---
   public function AllData()
   {
    return $this->db->table('mahasiswa')->get()->getResultArray();